app/controllers/news_controller.rb

SELECT * FROM `news` WHERE (`news`.`id` = 0)
---
  def show
    @news = News.find(params[:id])