app/controllers/streams_controller.rb

  def index
    @streams = Stream.all
---
SELECT * FROM `streams`

  def search_streams
    @streams = Stream.search params
---
SELECT * FROM `streams` WHERE ((name LIKE '%test%'))

  def send_email
    @stream = Stream.find(params[:id])
---
SELECT * FROM `streams` WHERE (`streams`.`id` = 11)

  def show
    @stream = Stream.find(params[:id])
---
SELECT * FROM `streams` WHERE (`streams`.`id` = 1)

  def new
    @stream = Stream.new
    @categories = Categories.find(:all, :limit => 6)

    if facebook_session
      facebook_user = facebook_session.user
      @tags = facebook_user.interests
      @friends = facebook_user.friends.to_a[0..3]
    end

    if params[:categories_id]
      if params[:categories_id] == "1"
        @streams = Stream.all
---
SELECT * FROM `streams` WHERE (categories_id IN (2))

  def create
    @stream = Stream.new(params[:stream])
    @categories = Categories.find(:all, :limit => 6)
    @streams = Stream.all

    respond_to do |format|
      if @stream.save
---
SELECT * FROM `streams`
INSERT INTO `streams` (`name`, `updated_at`, `categories_id`, `user_id`, `created_at`) VALUES('A big can of woopass', '2009-10-17 20:36:35', NULL, NULL, '2009-10-17 20:36:35')

  def destroy
    @stream = Stream.find(params[:id])
    @stream.destroy
---
SELECT * FROM `streams` WHERE (`streams`.`id` = 3)
DELETE FROM `streams` WHERE `id` = 3