app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('Billy Bob', '5cc606206b4349be9b3ea79ac25668dbd73c6b15', '2009-10-17 20:37:04', 'b6c1a39dbdb4f9ec0aad4471d236bdea2c1b2f26', NULL, NULL, NULL, NULL, 'billy', 'billy@aol.com', '2009-10-17 20:37:04')

  def link_user_accounts
    if self.current_user.nil?
      #register with fb
      User.create_from_fb_connect(facebook_session.user)
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `fb_user_id`, `email_hash`, `remember_token`, `login`, `email`, `created_at`) VALUES('Scott Thorpe', NULL, '2009-10-16 19:39:16', NULL, NULL, 503484735, NULL, NULL, 'facebooker_503484735', '', '2009-10-16 19:39:16')